// 1〜100 までの数値を出力する
// ただし、次の条件のいずれかに当てはまる時は数字を出力する代わりに記載の指示に従う

// 数値が3で割り切れる場合、Fizzと出力する
// 数値が5で割り切れる場合、Buzzと出力する
// 数値が15で割り切れる場合、FizzBuzzと出力する

// 数値に3が含まれる場合、Fizzと出力する
// 数値に5が含まれる場合、Buzzと出力する
// 数値に3と5が含まれる場合、FizzBuzzと出力する

// 出力する優先度は FizzBuzz＞Fizz＞Buzz とする

for (let i = 1; i < 101; i++) {
  if (i%15 == 0 || ((i/10 | 0) == 3 && i % 10 == 5) || ((i/10 | 0) == 5 && i % 10 == 3)) {
    console.log("FIZZBUZZ")
  } else if ((i%3 == 0) || ((i/10 | 0) == 3) || (i%10==3)) {
    console.log("FIZZ")
  } else if((i%5 == 0) || ((i/10 | 0) == 5) || (i%10==3)) {
    console.log("BUZZ")
  } else console.log(i)
}